{
  "items": [
    {
      "name": "key",
      "description": "Here is a key. It must unlock something nearby.",
      "pick-up": "You pick up the key and place it in your backpack."
    },
    {
      "name": "shovel",
      "description": "A shovel rests against the wall. Perhaps this would come in handy?",
      "pick-up": "You pick up the shovel and tie it to the side of your backpack."
    },
    {
      "name": "mound-of-dirt",
      "description": "There is a disturbed patch of ground here. It looks as if something was hastily buried.",
      "requires": ["shovel"],
      "use": "You start to dig into the dirt, and soon unearth two red candles.",
      "use-result": "red-candles"
    },
    {
      "name": "backpack",
      "description": "Here is a small, weathered backpack. This could be useful",
      "use": "You pick up the backpack and throw it over one shoulder."
    },
    {
      "name": "lantern",
      "description": "Here is a dusty lantern. It looks like it hasn't been used in a long time, but it should still light.",
      "pick-up": "You pick up the lantern and place it in your backpack.",
      "needs-lighting": true,
      "use": "You strike a match against the box and a flame bursts into life. You then insert the flame into the lantern, causing it to bring forth a warm, golden glow. The room around you becomes more visible."
    },
    {
      "name": "matches",
      "description": "Here is a box of matches. Perhaps you'll need to light something later on.",
      "pick-up": "You pick up the matches and place it in your backpack."
    },
    {
      "name": "salt",
      "description": "Here is a bag of salt. You have watched enough supernatural shows to know what this is for.",
      "pick-up": "You pick up the bag of salt and place it in your backpack.",
      "use": "You step behind one of the shelves and draw a circle using the salt. You then step inside and crouch down, hoping to stay out of sight."
    },
    {
      "name": "dried-herbs",
      "description": "Here is a small bundle of dried herbs.",
      "pick-up": "You pick up the bundle of herbs and place it in your backpack."
    },
    {
      "name": "mortar-pestle",
      "description": "There is a mortar & pestle stood on the kitchen counter.",
      "requires": ["dried-herbs"],
      "use": "You place the herbs into the mortar & pestle and grind the herbs into a fine dust.",
      "use-result": "ground-herbs"
    },
    {
      "name": "ground-herbs",
      "description": "The mortar and pestle contains the ground bundle of herbs.",
      "pick-up": "You pour the powder into a piece of kitchen roll and place it in your backpack.",
      "use": "You sprinkle the herbal powder onto the red candle flames. A bright green light flashes through the room, then they return to normal."
    },
    {
      "name": "chalk",
      "description": "Here is a piece of white chalk. This could be useful for drawing your trap.",
      "pick-up": "You pick up the chalk and place it in your backpack.",
      "use": "You take the chalk and draw an intricate pattern on the floor. This looks sure to trap the demon in place."
    },
    {
      "name": "red-candles",
      "description": "Here are two ugly looking red candles. Perhaps they will have a use?",
      "pick-up": "You dust the candles off and place them in your backpack.",
      "needs-lighting": true,
      "use": "You strike a match against the box and a flame bursts into life. You then light the candles one by one, watching the eerie red smoke trail up the stairs.",
      "place": "You place the candles one each side of the bottom of the stairs."
    },
    {
      "name": "rug",
      "description": "A small dusty rug is rolled up and tucked inside the crate.",
      "pick-up": "You place the rug into your backpack.",
      "use": "You unroll the rug and place it over the trap."
    },
    {
      "name": "patch-of-even-ground",
      "requires": ["ground-herbs", "red-candles", "rug", "chalk", "matches", "salt"],
      "description": "This looks like a great spot to place something.",
      "use-result": "Navigate to epilogue",
      "use": "You glance into your backpack at the assorted items. This looks like it may be good enough to capture this demon and wake you from this eternal sleep, but who knows at this point. Either way, it's time for action. You place the candles one each side of the bottom of the stairs, strike your matches, and light them. An eerie green flame bursts from the wick, then settles, leaving an unnatural glow behind. You take the chalk and draw an intricate pattern on the floor, which you just hope is enough. You then sprinkle the ground herbs over the trap, which causes the whole thing to hiss and steam. Quickly you cover the trap with the rug, then step into a corner and draw a circle of salt around where you stand. This should keep you safe from the demon. Suddenly you hear the cellar door creek open, and the stench of sulfur fills the air. A deep, filthy laugh echos down the stairs. 'Did you think you could hide from me?' it rumbles, as it takes a step down. The sounds of its cloven foot echo on the stone steps. 'I know you are down here. Come out and play, I have a game in mind for someone like you.' Two more steps it takes, before noticing the green glow of the candles. 'What are these? Do you expect this to stop me from entering? HAHAHAH puny mortal, perhaps I misjudged your intelligence.' A few more heavy thuds on the steps, then a muffled thud as it steps onto the rug. You hear the demon sniffing the air '...What's that? That scent... seems familiar...' Suddenly a bright yellow light leaks out from underneath the rug, curling around like smoke and accompanied by a loud humming sound. It is not bad enough to make you cover your ears, yet the demon appears to be in agony. He clasps his clawed hands to his gnarled ears, writhing where he stands. 'WHAT IS THIS' he howls, stumbling forward. A pillar of white light bursts from the ground infront of the demon and shoots through the ceiling. More beams burst around him as he twists and turns, looking for an escape. Finally only his shadowy outline is distinguishable behind the pillar of light. 'FOOLISH LITTLE CREATURE!' comes the gutteral cry from behind the light. Is that singing you hear? 'DO YOU KNOW WHO I AM? YOU WILL REGRET THIS-AGHHHHH!' the growling and howling finally die down, and with it, the light. The candles extinguish and leave behind a disgusting smelling cloud of green smoke. Suddenly you sit up in bed, gasping for breath, sweating and shaking, but awake. You made it out of the dream world!"
    }
  ]
}